tutorials/incompressible/wDissipationTempConcentrationResidenceBlockageSinkTauSimpleFoamLocalGCV4FE/localGermanCarreau/0/cp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      cp;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 -1 0 0 0];

internalField   nonuniform List<scalar> 
71874
(
1700
1700
1700
1700
1700
1700
1700
1700
...
)
;

boundaryField
{
    centralInlet
    {
        type            zeroGradient;
    }
    leftInlet
    {
        type            fixedValue;
        value           uniform 1700;
    }
    rightInlet
    {
        type            fixedValue;
        value           uniform 2100;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultName
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
