tutorials/incompressible/wDissipationTempConcentrationResidenceBlockageSinkTauSimpleFoamLocalGCV4FE/localGermanCarreau/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

increasingConcenctation
{
    type            scalarCodedSource;
	name			sourceTime;
    active          yes;


    scalarCodedSourceCoeffs
    {
		selectionMode   all;     
		fields      (concentration);

        codeInclude
        #{
		#include "fvCFD.H"
        #};

        codeCorrect
        #{
            Pout<< "**codeCorrect**" << endl;
        #};

        codeAddSup
        #{
            //const Time& time = mesh().time();
            const scalarField& V = mesh_.V(); 				//list of cell volumes
            const vectorField& C = mesh_.C(); 				//list of cell center coordinates
			volVectorField W = mesh_.lookupObject<volVectorField>("W"); 
			//vectorField U_internal = U.internalField();
			//fvMesh & mesh  =  U.mesh();
            scalarField& concentrationSource = eqn.source();
			//scalarField strainRate = (sqrt(2.0)*mag(symm(fvc::grad(U))));
			            forAll(C, i)
            {
                concentrationSource[i] -= -1.0*V[i];
            }
            Pout << "***codeAddSup***" << endl;
			Pout << "***Adding source term to concentration equation***" << endl;
        #};

        codeSetValue
        #{
            Pout<< "**codeSetValue**" << endl;
        #};

        // Dummy entry. Make dependent on above to trigger recompilation
        code
        #{
            $codeInclude
            $codeCorrect
            $codeAddSup
            $codeSetValue
        #};
    }

    sourceTimeCoeffs
    {
       selectionMode   all;     
    }
}


// ************************************************************************* //
