tutorials/incompressible/wDissipationTempConcentrationResidenceBlockageSinkTauSimpleFoamLocalGCV4FE/localGermanCarreau/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
            	volScalarFieldValue materials 0	//indicates fluid part of the mesh
            	volScalarFieldValue DT 1e-7	
	   	volScalarFieldValue sink 0	
	   	volScalarFieldValue cp 2100	
		volScalarFieldValue localnuA 12.87
		volScalarFieldValue localB 0.1871
		volScalarFieldValue localC 0.655
		volScalarFieldValue localTs 237
		volScalarFieldValue localTmeasure 473	
);

regions
(
	boxToCell
	{
	box (-100 -100 -100) (100 0 100);
        fieldValues
        (
            volScalarFieldValue localnuA 1.287	//low viscosity material 
            volScalarFieldValue cp 1700	//low viscosity material also has lower heat capacity
            volScalarFieldValue DT 3e-7	//low viscosity material also higher thermal diffusivity
        );
	}    


surfaceToCell
	{      
    file			"flowChannel.stl";

	outsidePoints	((0 0 -10e-3));
	useSurfaceOrientation true;
	
	
	//enable one of the following five
	nearDistance 	-1;			//-1 means deactivated, otherwise: pick all cells within [value] m of geometry.stl
	includeInside	false;		// pick all cells entirely within the geometry.stl
	includeOutside	true;		// pick all cells entirely outside of geometry.stl
	includeCut		true;		// pick all cells intersected by geometry.stl
	curvature		-100;		//-100 means deactivated, combine this with nearDistance
			
        fieldValues
        (
            volScalarFieldValue materials 1	//indicates steel part of the mesh
            volScalarFieldValue DT 1e-5	//thermal diffusivity of steel
        );
    }
 	
	    surfaceToCell
	{      
    file			"sink.stl";

	outsidePoints	((0 0 -10e-3));
	useSurfaceOrientation false;
	
	
	//enable one of the following five
	nearDistance 	-1;			//-1 means deactivated, otherwise: pick all cells within [value] m of geometry.stl
	includeInside	true;		// pick all cells entirely within the geometry.stl
	includeOutside	false;		// pick all cells entirely outside of geometry.stl
	includeCut		true;		// pick all cells intersected by geometry.stl
	curvature		-100;		//-100 means deactivated, combine this with nearDistance
			
        fieldValues
        (
            volScalarFieldValue sink 0	//indicates fluid part of the mesh
        );
    }




);

 

// *********************
